#include<stdio.h>
#include<stdlib.h>
int main()
{
	//四个人都有可能说假话，但只有一个人说了假话，其余全为真话
	//用四个循环把四个人的各种情况概括进去，然后根据他们的证词
	//来排除不满足的情况
	//假设0为说假话，1为说真话
	//A 为A是凶手或A不是凶手 a == 1||a != 1
	//B 为C是凶手或C不是   c == 1||c != 1
	//C 为D是或不是  d == 1||d != 1
	//D 为D不是或是  d != 1||d ==1
	int a, b, c, d;
	for (a = 0; a <= 1;a++)
	{
		for (b = 0; b <= 1;b++)
		{
			for (c = 0; c <= 1;c++)
			{
				for (d = 0; d <= 1;d++)
				{
					if (a == 0 && b != 0 && c != 0 && d != 0 ||
						b == 0 && a != 0 && c != 0 && d != 0 ||
						c == 0 && a != 0 && b != 0 && d != 0 ||
						d == 0 && a != 0 && c != 0 && b != 0)
					{
						if ((a == 1 || a != 1) && (c == 1 || c != 1) &&
							(b == 1 || b != 1) && (d != 1 || d == 1) && 
							(c != d) && ((b && c ) != 1))
						{
							printf(" a = %d\n b = %d\n c = %d\n d = %d\n"
								,a,b,c,d);
							if (a == 0)
								printf("凶手是A\n");
							if (b == 0)
								printf("凶手是D\n");
							if (c == 0)
								printf("凶手是C\n");
							if (d == 0)
								printf("凶手是D\n");
						}
					}
				}
			}
		}
	}


	system("pause");
}